package com.example.myapplicationnew;

import androidx.appcompat.app.AppCompatActivity;
import androidx.core.content.ContextCompat;
import androidx.recyclerview.widget.GridLayoutManager;
import androidx.recyclerview.widget.RecyclerView;

import android.content.Intent;
import android.net.Uri;
import android.os.Bundle;
import android.text.Editable;
import android.text.TextWatcher;
import android.util.Log;
import android.view.View;
import android.widget.AdapterView;
import android.widget.ArrayAdapter;
import android.widget.Button;
import android.widget.EditText;
import android.widget.ImageView;
import android.widget.ListView;
import android.widget.SearchView;
import android.widget.Spinner;
import android.widget.Toast;

import java.text.DateFormat;
import java.text.SimpleDateFormat;
import java.util.ArrayList;
import java.util.Date;


public class Main2Activity extends AppCompatActivity  /*implements NewsAdapter.onNewsListener*/ {

    int test=0;
    ImageView img;
    ArrayList<NewsModel> arrayList;
    NewssAdapter adapter;
    ListView recycler_news;
    MyDatabaseSource source;
    NewsModel newsModel;
    EditText searchView;
    Spinner spinner;
    Button button;
    String category="";

    public static ArrayList<String> data1 = new ArrayList<String>();



    private int[] images ={R.drawable.smartphone,R.drawable.padma,R.drawable.mayday,R.drawable.hand,R.drawable.image2,R.drawable.fruit};

    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_main2);

        button = (Button)findViewById(R.id.website);
        spinner = (Spinner) findViewById(R.id.spinner);
        searchView = findViewById(R.id.search);

        if(data1.isEmpty()){
            data1.add("ক্যাটাগরি");
            data1.add("বিজ্ঞান");
            data1.add("বিনোদন");
            data1.add("খেলাধুলা");
            data1.add("জীবনমান");
            data1.add("ইতিহাস");
            data1.add("প্রকৃতি");
            data1.add("সাধারন অসাধারন");
            data1.add("সংস্কৃতি");
            data1.add("অর্থনীতি");
            data1.add("জানা অজানা");
            data1.add("জীবন বৃত্তান্ত");

        }

        ArrayAdapter<String> adapter = new ArrayAdapter<String>(this, android.R.layout.simple_list_item_single_choice, data1);
        spinner.setAdapter(adapter);


        spinner.setOnItemSelectedListener(new AdapterView.OnItemSelectedListener() {
            @Override
            public void onItemSelected(AdapterView<?> adapterView, View view, int i, long l) {
                category = spinner.getSelectedItem().toString();

                if (!category.equals("ক্যাটাগরি")){
                    category(category);
                }
            }

            @Override
            public void onNothingSelected(AdapterView<?> adapterView) {

            }
        });

        searchView.addTextChangedListener(new TextWatcher() {
            @Override
            public void beforeTextChanged(CharSequence charSequence, int i, int i1, int i2) {

            }

            @Override
            public void onTextChanged(CharSequence charSequence, int i, int i1, int i2) {

            }

            @Override
            public void afterTextChanged(Editable s) {
                 filter(s.toString());
            }
        });


        button.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View v) {

                Intent intent = new Intent(Intent.ACTION_VIEW);
                intent.setData(Uri.parse("https://ebongaro.com"));
                startActivity(intent);
            }
        });

        source = new MyDatabaseSource(Main2Activity.this);

     /*  newsModel = new NewsModel("20/01/2020","স্মার্টফোনের কিছু অজানা ফিচার","বর্তমান সময়ে প্রায় সবার হাতেই রয়েছে মুঠোফোন। আর সেই মুঠোফোনের মাঝে এখন জনপ্রিয় আর বহুল ব্যবহৃত হলো স্মার্টফোন। মূলত কথা বলার জন্য ফোনের ব্যবহার হলেও এখন স্মার্টফোনগুলি ছোটখাটো কম্পিউটারের মতো কাজ করে থাকে। কথা বলা ছাড়াও অনেক রকম জরুরী কাজ করা যায় শুধু ফোনেই। স্মার্টফোনে  রয়েছে অনেক অনেক ফিচার। কিছু কিছু ফিচার মোটামুটি সবাই জানেন আর কিছু ফিচার রয়েছে যা বেশিরভাগ ইউজারই জানেন না। এমনই কিছু ফিচার নিয়ে কথা বলবো আজ। \n" +
                "\n" +
                "স্মার্টফোনের ক্ষেত্রে একটি বড় ব্যাপার হলো ব্যাটারি ব্যাকাপ। ব্যাটারি দ্রুত শেষ হওয়া ও চার্জ দেয়া নিয়ে সব সময়ই একটা ভোগান্তি থেকে যায়। এই ভোগান্তি কমানোর বেশ কিছু উপায় রয়েছে। আপনি যদি আপনার স্ক্রিনের জন্য একটি কালো বা ডার্ক ব্যাকগ্রাউন্ড বেছে নেন তবে স্বয়ংক্রিয় পিক্সেল হাইলাইটিং বন্ধ হয়ে যাবে এবং আপনি লক্ষ্য করবেন যে আপনার ডিভাইসটি বেশি সময় ধরে চার্জ রাখে। এই বৈশিষ্ট্যটি এখনও সমস্ত অ্যান্ড্রয়েড ডিভাইসের জন্য উপলভ্য নয় তবে এটি ইতিমধ্যে বেশিরভাগ স্যামসাং স্মার্টফোন এবং ট্যাবলেটগুলিতে প্রয়োগ করা হয়েছে। এছাড়াও অনেক সময় আমরা সারাক্ষণই ফোনের ওয়াইফাই অন করে রাখি, সাথে মাঝে মাঝে লোকেশনও অন করা থাকে। এগুলো যখন ব্যবহার করা হয় না তখন অফ করে রাখা জরুরী নতুবা চার্জ শেষ হবে দ্রুত। অনেক সময় জরুরী কাজের কারণে কল রিসিভ করা সম্ভব হয় না। জরুরী কাজ থাকায় কোন কল ধরতে না পারলে তার জন্য অটোমেটিক রিপ্লাই দেওয়ার ব্যবস্থা আছে স্মার্টফোনে। আপনি নিজের ইচ্ছেমত রিপ্লাই বানিয়ে রাখতে পারবেন এবং পড়ে সেগুলো ব্যবহার করতে পারবেন। এজন্য Setting গিয়ে Phone Setting এ যেতে হবে। তারপর Respond with Text অপশনে Create Own Message লেখায় ট্যাপ করে মেসেজটি লিখে রাখা যাবে।\n" +
                "\n" +
                " \n" +
                "\n" +
                "আমরা সবাই জানি মাউস ও কিবোর্ড ব্যবহৃত হয় কম্পিউটারে, তবে অনেকেই জানেন না এই কিবোর্ড বা মাউস ফোনেও ব্যবহার করা যায়। ওটিজি ক্যাবলের মাধ্যেমে আপনি কীবোর্ড বা মাউস মোবাইলের সাথে যুক্ত করতে পারবেন সহজেই। তবে এজন্যে আপনার ফোনটিতে ওটিজি সমর্থন থাকতে হবে।\n" +
                "\n" +
                "ফোন থেকে ভুলবশত ছবি বা ভিডিও ডিলিট হয়ে যাওয়া একটি নিয়মিত সমস্যা অনেকের কাছেই। এ সমস্যা এড়াতে রয়েছে একটি সহজ ফিচার। এর মাধ্যমে আপনি অটো ব্যাকআপ অন করে রাখতে পারেন। ফিচারটি চালু করতে ফোনের Setting গিয়ে System Option এ যান, Backup অপশনটি অন করুন, আপনার Gmail আইডিটি সিলেক্ট করুন এবং Backup Now অপশনে ক্লিক করুন। \n" +
                "\n" +
                "নিজের ফোনটি নানা কারণে অন্যের হাতেও দিতে হয় কিছু সময়ের জন্যে। তখন সিকিউরিটি নিয়ে একটা চিন্তা চলে আসে। এই চিন্তা কিছুটা দূর করতে পারে স্ক্রিন পিনিং ফিচারটি। এর মাধ্যমে অপরজন আপনার বের করে দেয়া অ্যাপ ছাড়া অন্য অ্যাপ ব্যবহার করতে পারবেন না। এটি চালু করতে ফোনের Setting অপশনে গিয়ে Lock Screen and Security তে ক্লিক করে Other Security অপশনে গিয়ে Pin Window অন করে দিতে হবে।\n" +
                "\n" +
                " \n" +
                "\n" +
                "ফোনে আর্টিকেল পড়ার পাশাপাশি শোনাও যাবে। অনেকেই এই ফিচারটি সম্পর্কে জানেন না। এটি সচল করতে ফোনের Setting এ গিয়ে Accessibility অপশনে যেতে হবে। সেখানে গিয়ে Text to Speech অপশন অন করে দিলেই পড়ার পাশাপাশি শুনতেও পারবেন। \n" +
                "\n" +
                "ইন্টারনেট অন করে বিভিন্ন সাইটে গেলে অনেক সাইটেই অ্যাড দেখায় যা খুবই বিরক্তির কারণ হয়ে দাঁড়ায়। অ্যাড বন্ধ করার জন্যে রয়েছে সহজ একটি উপায়। Settings থেকে Google Ads এ যান, এরপর Opt Out of Ads Personalization টি Enable করুন।\n" +
                "\n" +
                "মনে করুন আপনার ফোনটি হারিয়ে গেল এবং সেটি যার হাতে পড়লো তিনি ফোনটি আপনাকে ফেরত দিতে চান কিন্তু ফোনটি কার সেটা তো তিনি জানেন না। কারণ ফোন সুরক্ষিত রাখতে আপনি ফোন লক করে রাখেন ফিঙ্গারপ্রিন্ট, প্যাটার্ন বা পাসওয়ার্ড দিয়ে। এই সমস্যারও রয়েছে সমাধান। আপনি চাইলেই আপনার লক স্ক্রিনে আপনার নাম, ঠিকানা বা পরিচিত জনের ফোন নাম্বার নাম্বার দিয়ে দিতে পারেন। এই গুরুত্বপূর্ণ ফিচারটি অন করতে প্রথমে ফোনের Setting অপশনে গিয়ে Lock Screen and Security তে যেতে হবে। তারপর Info and App Shortcut এ ক্লিক করতে হবে। সেখানে গিয়ে Owner Information এ ক্লিক করার পর আপনার প্রয়োজনীয় তথ্য দিয়ে Done দিলেই লক স্ক্রিনে আপনার দেয়া তথ্য ভেসে উঠবে। \n" +
                "\n" +
                "বিভিন্ন ফোনের ব্র্যান্ড অনুযায়ী সেটিংগুলোতে কিছুটা পরিবর্তন হতে পারে। এছাড়াও অ্যান্ড্রয়েড আপডেট আসার কারণেও সেটিং পরিবর্তন হয়ে থাকে। তবে ফিচারগুলো সব ফোনেই কমবেশি কার্যকরী। কমন ফিচারের পাশাপাশি এই ফিচারগুলো ব্যবহারের মাধ্যমে আপনি পেতে পারেন বাড়তি সুবিধা। ",
                images[0],"জানা অজানা","স্মার্টফোন");*/
       /*  newsModel = new NewsModel("26/03/2021","পদ্মা সেতু – জাতির একটি স্বপ্নের বাস্তবায়ন","বর্তমান সময়ে প্রায় সবার হাতেই রয়েছে মুঠোফোন। আর সেই মুঠোফোনের মাঝে এখন জনপ্রিয় আর বহুল ব্যবহৃত হলো স্মার্টফোন। মূলত কথা বলার জন্য ফোনের ব্যবহার হলেও এখন স্মার্টফোনগুলি ছোটখাটো কম্পিউটারের মতো কাজ করে থাকে। কথা বলা ছাড়াও অনেক রকম জরুরী কাজ করা যায় শুধু ফোনেই। স্মার্টফোনে  রয়েছে অনেক অনেক ফিচার। কিছু কিছু ফিচার মোটামুটি সবাই জানেন আর কিছু ফিচার রয়েছে যা বেশিরভাগ ইউজারই জানেন না। এমনই কিছু ফিচার নিয়ে কথা বলবো আজ। \n" +
                "\n" +
                "বাংলাদেশের মানুষের কাছে বহুদিনের এক স্বপ্ন ছিল পদ্মা সেতু। অবশেষে সেই স্বপ্ন পূরণের একদম কাছে আমরা। তবে এই স্বপ্ন পূরণ করা এতো সহজ ছিল না। অনেক চড়াই উতড়াই পেরিয়ে এগোতে হয়েছে একটু একটু করে। \n" +
                " \n" +
                "\n" +
                "পদ্মা সেতু নিয়ে কথা বলার আগে একটু জেনে নেওয়া দরকার প্রমত্ত পদ্মা নদীকে নিয়ে। পদ্মা নদী আমাদের দেশের সব থেকে বড় কয়েকটি নদীর মাঝে ও বিশ্বের সব থেকে খরস্রোতা নদীগুলোর মাঝে একটি । “পদ্মা নদীর মাঝি” উপন্যাসের মাধ্যমে ছোটবেলা থেকেই এই নদী সম্পর্কে আমাদের আগ্রহ। কমবেশি সবাই একবার হলেও দেখেছি পদ্মাকে। পদ্মার গভীরতার একটা সহজ হিসেব দেই। পানি থেকে পদ্মার তলদেশের দূরত্ব ৪০ মিটার। ৪০ মিটারকে ফিটে প্রকাশ করলে হয় প্রায় ১৩১ ফিট। এক তলার উচ্চতা হয় সাধারনত ১০ ফিট। সেই হিসাব করে বললে সহজ ভাষায় পানি থেকে তলদেশ পর্যন্ত পদ্মা প্রায় ১৩ তলা বিল্ডিং এর সমান গভীর। এই গভীরতার সাথে সাথে খরস্রোতা নদী ও নদীর তলদেশে মাটির স্তরের গঠন নিয়েও ছিল জটিলতা। তাই এতে পিলার বসিয়ে উপরে সেতু বানানো মোটেই সহজ কাজ ছিল না। \n" +
                "\n" +
                "পদ্মা সেতুর মাধ্যমে মুন্সিগঞ্জের লৌহজংয়ের সাথে শরিয়তপুর ও মাদারীপুর জেলা যুক্ত হবে। এর ফলে দেশের দক্ষিণ-পশ্চিম অংশের সাথে উত্তর-পূর্ব অংশের সংযোগ ঘটবে। পদ্মাসেতু শুধু দেশের দক্ষিণ-পশ্চিমাঞ্চলের অপেক্ষাকৃত বঞ্চিত ও পিছিয়ে পড়া জনগোষ্ঠীকে রাজধানী ঢাকা এবং চট্টগ্রামের অর্থনৈতিক লাইফলাইনের সঙ্গে সংযুক্ত করবে না বরং এটি পুরো অর্থনীতিকে আক্ষরিক অর্থে একসূত্রে গাঁথার সবচেয়ে গুরুত্বপূর্ণ মাধ্যম হিসেবে কাজ করবে। দেশের অর্থনীতির দ্বিতীয় সর্বোত্তম লাইফলাইনের ভূমিকায় অবতীর্ণ হতে মোটেও সময় নেবে না বলে ধারণা করছেন বিশেষজ্ঞরা। ২০১২ সালের ৩০ জুন বিশ্ব ব্যাংক সেতু নির্মাণে বরাদ্দ ১.২ বিলিয়ন ডলারের ঋণ বাতিলের সিদ্ধান্ত ঘোষণা করে। \n" +
                " \n" +
                "ফলে নিজ দেশের অর্থায়নে প্রকান্ড পদ্মার উপর সেতু নির্মাণের সিদ্ধান্ত ছিল বাংলাদেশের মতো একটি উন্নয়নশীল দেশের জন্যে নেওয়া ইতিহাসের সব থেকে বড় চ্যালেঞ্জ। ২০১৪ সালের নভেম্বরে শুরু হয় মূল সেতুর কাজ, সঙ্গে স্বপ্ন বাস্তবায়নেরও। ২০১৫ সালের ১২ ডিসেম্বর প্রধানমন্ত্রী মূল সেতুর নির্মাণ কাজের আনুষ্ঠানিক উদ্বোধন করেন। পদ্মা সেতু নির্মাণকারী ঠিকাদারি প্রতিষ্ঠানের নাম চায়না মেজর ব্রিজ ইঞ্জিনিয়ারিং কোম্পানি। তারা জানিয়েছে পদ্মা সেতু যানবাহন চলাচলের উপযোগী হতে ২০২২ সালের এপ্রিল মাস পর্যন্ত লেগে যেতে পারে।   \n" +
                "\n" +
                "\n" +
                "সেতু বিভাগ গবেষণা করে জানায় পদ্মা সেতুর ফলে দেশের জিডিপি বাড়বে ১.২৬ শতাংশ ও দেশের দক্ষিণ-পশ্চিমাংশের অর্থনৈতিক প্রবৃদ্ধি বাড়বে ২ শতাংশ। দেশের দক্ষিণ-পশ্চিমাঞ্চলের জনগণের জীবন ও জীবিকা গত কয়েক দশকে বারবার ভয়ানক প্রাকৃতিক দুর্যোগের শিকার হয়েছে। যে দুর্দশার কবলে তারা পতিত হয়েছে এই সেতুর অর্থনৈতিক সুফল পেয়ে অঞ্চলটি তা থেকে মুক্তি পেয়ে পুনরুজ্জীবিত হবে। দেশের দক্ষিণ-পশ্চিমাঞ্চলের ২১ জেলার মানুষের ভাগ্য বদলে নতুন দিগন্ত উন্মোচন করবে পদ্মা সেতু। " +
                "\n" +
                "গত ১২ই ডিসেম্বর,২০২০ তারিখে পদ্মা সেতুর ৪১তম ও সর্বশেষ স্প্যানটি বসানো হয় ও এর ফলে যুক্ত হয় পদ্মার দুই পাড়ের মানুষের স্বপ্ন। ১৫০ মিটার দৈর্ঘ্যের ৪১ টি স্প্যান বসানোর মাধ্যমে  দৃশ্যমান হয় ৬.১৫০ কিলোমিটার দৈর্ঘ্য এবং ১৮.১০ মিটার প্রস্থের স্বপ্নের পদ্মা সেতু। পদ্মা সেতু নির্মাণে মোট খরচ করা হচ্ছে ৩০ হাজার ১৯৩ দশমিক ৩৯ কোটি টাকা। পদ্মা সেতু নিয়ে একটি গুজবও তৈরি হয় যার কথা না বললেই নয়। সেতু নির্মাণের জন্য বেশ কয়েকটি এলাকায় মানুষ অপহৃত হচ্ছে বলে গুজব ছড়িয়ে পড়ে। গুজব শুরু হয় যে পদ্মা সেতু তৈরিতে মানুষের মাথা লাগবে। পরে অবশ্য এটি গুজব বলেই প্রমাণিত হয়।" +
                "\n" +
                "\n" +
                "পদ্মা সেতু কেবল একটি সেতুই নয়, এটি আমাদের গর্ব। এটি নির্মাণের মাধ্যমে বিশ্ববাসী আবার জানতে পারলো বাঙ্গালী মাথা নোয়াবার জাতি নয়। পদ্মা সেতু আমাদের আত্মমর্যাদা ও গর্বের আরেকটি সংযোজন। সুকান্ত ভাট্টাচার্যের ‘দুর্মর’ কবিতার এই লাইনটিই যেন তার প্রতিচ্ছবি," +
                "\n" +
                "\n" +
                "“সাবাস, বাংলাদেশ, এ পৃথিবী\n" +
                "অবাক তাকিয়ে রয়:\n" +
                "জ্বলে-পুড়ে-মরে ছারখার\n" +
                "তবু মাথা নোয়াবার নয়!” ",

                images[1],"জীবনমান","পদ্মা সেতু");*/
           newsModel = new NewsModel("01/05/2021","আন্তর্জাতিক শ্রমিক দিবসের ইতিহাস","মে মাসের এক তারিখে আন্তর্জাতিক শ্রমিক দিবস পালিত হয় যা মে দিবস নামেই সারা বিশ্বে বহুল পরিচিত।  শ্রমিক আন্দোলন ও শ্রম অধিকার আদায়ের এ দিনটি বছরের পর বছর ধরে বিশ্বব্যাপী যথাযথ মর্যাদায় পালিত হচ্ছে। বিশ্বের প্রায় ৮০ টি দেশে এই দিনটি সরকারি ছুটির দিন হিসেবে পালিত হয়। এছাড়াও  আরো অনেক দেশে দিনটি বেসরকারিভাবে পালিত হয়। খেটে খাওয়া শ্রমজীবী মানুষের অধিকার আদায়ে রক্তঝরা সংগ্রামের গৌরবময় ইতিহাস সৃষ্টির দিন এই মে দিবস বা মে ডে। আমোরিকার শিকাগো শহরের হে মার্কেটের ম্যাসাকারে শহীদদের আত্মত্যাগকে স্মরণ করে পালিত হয় দিনটি।  \n" +
                        " \n" +
                        "\n" +
                        "সময়টা ছিল ঊনবিংশ শতাব্দির শুরুর দিকে। পশ্চিমা বিশ্বে শিল্প বিপ্লব তখন ব্যাপক আকারে ছড়িয়ে পড়েছে। এদিকে শ্রমিকদের তখন ১০ থেকে ১২ ঘন্টা কাজ করতে হতো এবং কাজের অনুপাতে মজুরি ছিল খুবই কম। অস্বাস্থ্যকর পরিবেশ ও দীর্ঘ সময় কাজ করার কারণে প্রতি বছর অনেক শ্রমিক অসুস্থ হতে শুরু করেন। মানবেতর জীবনযাপন করার পাশাপাশি তাদের উপর চলতো মালিকদের অত্যাচার ও দুর্ব্যবহার। এরই ফলশ্রুতিতে শ্রমিকরা তাদের মজুরি না কমিয়ে সারা দিনে আট ঘণ্টা কাজের সময় নির্ধারণের দাবিতে ১৮৬০ সালে একটি সংগঠন তৈরি করে। সংগঠনটির নাম আমেরিকান ফেডারেশন অব লেবার। সংগঠনটি শ্রমিকদের অধিকার আদায়ের লক্ষ্যে কাজ করে যেতে থাকে।\n" +
                         "\n" +
                        "১৮৮৪ সালে যুক্তরাষ্ট্রের শিকাগো শহরে শ্রমিকরা মালিকপক্ষকে দৈনিক আট ঘণ্টা কর্মসময় নির্ধারণের দাবি জানিয়ে বলে ১৮৮৬ সালের ১ মে থেকে যুক্তরাষ্ট্রে সর্বোচ্চ কর্মঘণ্টা ৮ ঘণ্টা ধরে আইন পাস করতে হবে কিন্তু মালিকপক্ষ এই দাবি কানেই তোলে নি। ফলে ১৮৮৬ সালের ১ মে যুক্তরাষ্ট্রজুড়ে ১৩ হাজার ব্যবসায়ী প্রতিষ্ঠান থেকে কাজ প্রত্যাহার করে বের হয়ে যায় ৩ লাখের বেশি শ্রমিক। দুই দিনের মাঝে সে সংখ্যা বেড়ে ১০ লাখ ছাড়ায়। ৩ মে’র মাঝে পুরো দেশ জুড়ে এই বিক্ষোভ ছড়িয়ে পড়ে। \n" +
                        "\n" +
                        "সে৪ মে, ১৮৮৬ সাল; ঘড়িতে তখন সন্ধ্যা সাড়ে সাতটা। শিকাগোর হে মার্কেট নামক স্থানে আন্দোলন গড়ে তোলেন শ্রমিকরা। তাদের পক্ষে বক্তব্য দিচ্ছিলেন আমেরিকান লেবার অ্যাক্টিভিস্ট অগাস্ট স্পিস। শ্রমিকদের ঘিরে থাকা পুলিশের প্রতি এক অজ্ঞাতনামার বোমা নিক্ষেপের পর পুলিশ শ্রমিকদের ওপর গুলীবর্ষণ শুরু করে। এই বোমার আঘাতে তৎক্ষণাৎ নিহত হন মেথিয়াস জে. ডিগান নামের একজন পুলিশ কর্মকর্তা। পরবর্তীতে আহত হওয়া আরো ৬ জন নিহত হন। দু’পক্ষের সংঘর্ষে হে মার্কেট তখন রণক্ষেত্রে রূপ নেয়। পুলিশের গুলিতে নিহত হন প্রায় ১০ থেকে ১২ জন শ্রমিক। পুলিশের ওপর কে বা কারা বোমা হামলা করেছিলো তা সঠিক জানা না গেলেও পুলিশ হত্যার দায়ে অভিযুক্ত ও আটক করা হয় অগাস্ট স্পিসসহ আরও আটজনকে। ১৮৮৭ সালের ১১ নভেম্বর অগাস্ট স্পিসসহ অভিযুক্ত ৬ জনকে ফাঁসি দেওয়া হয়। অভিযুক্ত বাকি ২ জনের একজন কারাবন্দি অবস্থায় আত্মহত্যা করেন ও অন্য একজনের ১৫ বছরের কারাদণ্ড হয়। পরবর্তীতে প্রমাণিত হয় তারা কেউই অপরাধী ছিলেন না। \n" +
                        "\n" +
                        "\n" +
                        "হে মার্কেটের এই ঘটনা সারা বিশ্বকে নাড়া দিয়েছিল। এ ঘটনার পর ইউরোপে গড়ে ওঠে সমাজতান্ত্রিক ও লেবার পার্টিগুলোর নতুন জোট। তারা শ্রমিকদের দাবির পক্ষে আন্দোলন চালিয়ে যেতে থাকে। ১৮৮৯ সালে প্যারিসে ফরাসি বিপ্লবের একশো বছর প‍ূর্তিতে শিকাগো শ্রমিক আন্দোলনের দিনটিকে ১৮৯০ সাল থেকে উদযাপনের প্রস্তাবনা দেওয়া হয়। অবশেষে মে দিবস আন্তর্জাতিক স্বীকৃতি পায় ১৯০৪ সালে। বিশ্বব্যাপী প্রতিষ্ঠা পায় শ্রমিকদের দৈনিক আট ঘণ্টা কাজ করার দাবি। \n" +
                        "\n" +
                        "\n" +
                        "আশ্চর্যের ব্যাপার হলো যে দেশে এই আন্দোলনের জন্ম ও ঘটনাগুলো ঘটেছে সেই যুক্তরাষ্ট্রেই মে দিবস পালিত হয় না। তাদের সাথে সাথে কানাডাও দিনটি পালন করে না। ১৮৯৪ সালে পুলম্যান হামলার পর তৎকালীন প্রেসিডেন্ট গ্রুভার ক্লিভল্যান্ড যুক্তরাষ্ট্রে সেপ্টেম্বরের প্রথম সোমবারকে শ্রমিক দিবস হিসেবে ঘোষণা করেন এবং তখন থেকে এই দুটি দেশে সেপ্টেম্বরের প্রথম সোমবার শ্রমিক দিবস পালিত হয়ে আসছে। \n" +
                        "\n" +
                        "",

                images[2],"ইতিহাস","আন্তর্জাতিক শ্রমিক দিবস");
         /*newsModel = new NewsModel("02/07/2020","হ্যান্ড স্যানিটাইজার ব্যবহারে সতর্কতা","বর্তমানে করোনার কারণে সারাবিশ্ব প্রাণঘাতী সমস্যার মধ্যে পড়েছে। করোনা ভাইরাস থেকে বাঁচতে তাই সকলকে ঘরে থাকার নির্দেশ দেওয়া হয়েছে সরকারের তরফ থেকে। সারাদেশে এই মুহূর্তে করোনা আক্রান্ত রোগীর সংখ্যা তুলনায় অনেক বেশি, এমনকি মৃত্যুহারও দিন দিন বাড়ছে। এই অবস্থায় আমাদের সকলকে বাইরে চলাচলের ক্ষেত্রে সতর্ক থাকতে হবে। ঘরের বাইরে অবশ্যই মাক্স পরিধান করতে হবে, পরিষ্কার পরিচ্ছন্ন থাকতে হবে, বারবার সাবান বা হ্যান্ড স্যানিটাইজার দিয়ে হাত পরিষ্কার করতে হবে।\n" +
                " \n" +
                "\n" +
                "এই মহামারীতে হ্যান্ড স্যানিটাইজার এর ব্যবহার ব্যপকভাবে বৃদ্ধি পেয়েছে। কিন্তু আমরা অনেকেই এই স্যানিটারি ব্যবহারের প্রতি সতর্কতা অবলম্বন করিনা, আবার অনেকে জানেই না কি কি সতর্কতা অবলম্বন করতে হবে। যার ফলে বিভিন্ন সময় অসাবধানতার জন্য বিভিন্ন রকম দূর্ঘটনা ঘটে থাকে। চলুন জেনে নেই এই হ্যান্ড স্যানিটাইজার ব্যবহারের প্রতি সাবধানতার কারণ সম্পর্কে।\n" +
                "\n" +
                "\n" +
                "• অতিরিক্ত হ্যান্ড স্যানিটাইজার ব্যবহার করলে আমাদের অনেক সমস্যার সম্মুখীন হতে হয়। কারণ এই হ্যান্ড স্যানিটাইজারে অ্যালকোহলের পরিমাণ থাকে অনেক বেশি। আর এই কারণেই কোভিড ১৯ এর মতন ভাইরাস থেকে আমরা কিছুটা হলেও রক্ষা পেয়ে থাকি। তবে এই ভাইরাস দূর করতে ৯১% আইসোপ্রোপাইল অ্যালকোহল রয়েছে এমন হ্যান্ড স্যানিটাইজার ব্যবহার করার কথা বার বার বলা হয়েছে।\n" +
                "\n" +
                " \n" +
                "• এই হ্যান্ড স্যানিটাইজার লাগিয়ে আমাদের কখনোই আগুনের সামনে যাওয়া উচিত নয়। কারণ হ্যান্ড স্যানিটাইজার এর মধ্যে বেশিরভাগই অ্যালকোহল হওয়ার কারণে এতে সরাসরি আগুন লেগে যাওয়ার মতন বিপদ ঘটতে পারে। বিশেষ করে রান্নাঘরে যাওয়ার আগে আমাদের কখোনই উচিত না হ্যান্ড স্যানিটাইজার ব্যবহার করা। প্রয়োজনে বার বার সাবান দিয়ে হাত ধুয়ে নিতে হবে। করোনা ভাইরাস দূর করতে সাবান দিয়ে হাত পরিষ্কার করাই যথেষ্ট। তাই অবশ্যই আমাদের মাথায় রাখতে হবে যে হ্যান্ড স্যানিটাইজার ব্যবহার করে আগুনের সামনে যাওয়া ঠিক না। \n" +
                "\n" +
                "\n" +
                "• সম্প্রতি ভারতের ফুড অ্যান্ড ড্রাগ অ্যাডমিনিস্ট্রেশন জানিয়েছেন যে কিছু কিছু হ্যান্ড স্যানিটাইজারে এমন কিছু ক্ষতিকর অ্যালকোহল রয়েছে যা শরীরে ক্ষতিকর প্রভাব ফেলে। যেমনঃ মানুষ অন্ধ হয়ে যেতে পারে, এমনকি বড় কোনো রোগে কোমায় চলে যাওয়ার সম্ভাবনাও রয়েছে। শুধুমাত্র এই হ্যান্ড স্যানিটাইজার ব্যবহারের কারণে \n"+
                "\n" +
                "গবেষকদের মতে কিছু কিছু হ্যান্ড স্যানিটাইজার তৈরির আবশ্যিক উপাদান হিসেবে ইথানল ব্যবহৃত হচ্ছে, যা পরে মিথানল হিসেবে পজেটিভ হয়ে যায়। যা এক ধরনের ক্ষতিকর অ্যালকোহল।\n" +
                "\n" +
                "\n" +
                "• যেকোন শারীরিক অসুবিধায় বমি, মাথাব্যথা, অজ্ঞান হয়ে যাওয়া, অন্ধত্ব ইত্যাদি ঘটতে পারে মাত্রাতিরিক্ত স্যানিটাইজার এর কারণে। তাই এই ক্ষতি যেন না হয় তাই অ্যালকোহলের উপাদান হিসেবে ইথাইল ব্যবহারের প্রতি জোর দেওয়া হয়েছে। কারণ এই ইথাইলই একমাত্র উপাদান যা তেমন কোনো ক্ষতি করে না। স্যানিটাইজারে এটি প্রায় ৬০% ব্যবহার করা হয়ে থাকে। এর থেকে বেশিও কখনো কখনো ব্যবহার করা হয়। তবে কোনোভাবেই যেন আমরা মিথানল স্যানিটাইজার ব্যবহার না করি। যা পরবর্তীতে আমাদের নানান ক্ষতির সম্মুখীন করবে।\n" +
                "\n" +
                "\n" +
                "কিন্তু ইথানলের থেকে মিথানল অনেকটা সস্তা হয়ে থাকে তাই অনেক কেমিস্ট কম খরচে বেশি লাভবান হওয়ার জন্য মিথানল এর ব্যবহার করেন। এ ধরনের হ্যান্ড স্যানিটাইজার ব্যবহার করা থেকে আমাদের বিরত থাকতে হবে। ",
                images[3],"জানা অজানা","্যান্ড স্যানিটাইজার");

        newsModel = new NewsModel("23/09/2020","আমাদের একজন মাশরাফি বিন মর্তুজা","বাংলাদেশের মানুষ ক্রিকেট পাগল। এই ক্রিকেট পাগল জাতির জন্যে ক্রিকেটের হিরো হলেন মাশরাফি বিন মর্তুজা। তিনি যেন শুধু একজন ক্রিকেটারই নন, একজন ভালোবাসার মানুষ। মাশরাফি বাংলাদেশ দলের একজন উজ্জ্বল নক্ষত্র। বাংলাদেশ ক্রিকেটকে সামনের দিকে এগিয়ে নিতে তার ভূমিকা অসামান্য। ক্যাপ্টেন হিসেবে তিনি অনন্য। ক্যাপ্টেন এর দায়িত্ব পালনে তিনি কতোটা সফল তা মাঠে অনেকবার প্রমাণ করেছেন। দর্শক থেকে শুরু করে সতীর্থ পর্যন্ত সবার কাছেই তিনি ভালোবাসার পাত্র। জাতীয় ক্রিকেট টিমের প্লেয়ার হবার সাথে সাথে বর্তমানে তিনি নড়াইল-২ আসনের একজন নির্বাচিত সংসদ সদস্য।  \n" +
                " \n" +
                "\n" +
                "মাশরাফির ডাকনাম ‘কৌশিক’। ভক্তমহলে তাকে ডাকা হয় ‘ম্যাশ’ নামে। তার আরও একটি জনপ্রিয় নাম রয়েছে। সেটি হলো ‘নড়াইল এক্সপ্রেস’। ১৯৮৩ সালের ৫ অক্টোবর তিনি বাংলাদেশের দক্ষিণ-পশ্চিমের জেলা নড়াইলে জন্মগ্রহন করেন। ছোট থেকেই দুরন্ত আর চঞ্চল ম্যাশের পড়াশুনার থেকে বেশি পছন্দ ছিল ফুটবল আর ব্যাডমিন্টন খেলা আর সাথে মাঝে মধ্যে চিত্রা নদীতে সাঁতার কাটা। বর্তমানে তিনি বোলার হিসেবে সুপরিচিত হলেও তারুণ্যের শুরুতে যখন তার ক্রিকেটের প্রতি আগ্রহ জন্মে তখন প্রথম পছন্দ ছিল ব্যাটিং। \n" +
                "\n" +
                "\n" +
                "নড়াইলের ভিক্টোরিয়া কলেজে পড়ার সময় মাশরাফির পরিচয় হয় সুমনা হক সুমির সাথে। পরবর্তীতে ২০০৬ সালে দু’জনে বিবাহ বন্ধনে আবদ্ধ হন। বর্তমানে তাদের দুই সন্তান রয়েছে। তিনি ২০০৩-২০০৪ সালে দর্শনশাস্ত্রে জাহাঙ্গীরনগর বিশ্ববিদ্যালয়ে ভর্তি হয়েছিলেন। \n" +
                "\n" +
                " \n" +
                "বাংলাদেশ জাতীয় ক্রিকেট দলের সফলতম খেলোয়াড় ও বোলারদের মাঝে একজন হলেন মাশরাফি। অধিনায়ক হিসেবে ওয়ানডেতে ১০০টি উইকেট নেওয়া বোলারদের মধ্যে তিনি ৫ম বোলার। ইএসপিএন কর্তৃক পরিচালিত “ওয়ার্ল্ড ফেইম ১০০” এ বিশ্বের সেরা ১০০ জন ক্রীড়াবিদের মধ্যে একজন তিনি। অনূর্ধ-১৯ দলে থাকতেই তিনি ওয়েস্ট ইন্ডিজ সাবেক ফাস্ট বোলার অ্যান্ডি রবার্টসের নজর কেড়েছিলেন। অ্যান্ডি তখন সেই দলের অস্থায়ী বোলিং কোচের দায়িত্বে ছিলেন। তার পরামর্শেই মাশরাফিকে বাংলাদেশ এ দলে নেয়া হয়। সেখানে মাত্র  একটি ম্যাচ খেলেই মাশরাফি জাতীয় দলে প্রতিনিধিত্ব করার সুযোগ পান। \n" +
                "\n" +
                "\n" +
                "২০০১ সালের ৮ নভেম্বর বঙ্গবন্ধু জাতীয় স্টেডিয়ামে জিম্বাবুয়ের বিরুদ্ধে টেস্ট ক্রিকেটে মাশরাফির অভিষেক ঘটে। সেই বছরেই ২৩ নভেম্বর জিম্বাবুয়ের বিরুদ্ধেই তার ওয়ানডেতে অভিষেক হয়। অভিষেক ম্যাচে তিনি ৮ ওভার ২ বলে ২৬ রান দিয়ে তুলে নেন ২টি উইকেট। ইংল্যান্ডের বিপক্ষে ব্যক্তিগত তৃতীয় টেস্ট খেলার সময় তিনি হাঁটুতে আঘাত পান। সেই ইঞ্জুরির কারণে দুই বছর ক্রিকেটের বাইরে থাকতে হয় মাশরাফিকে। এরপর ২০০৪ সালে তিনি ভারতের সাথে ম্যাচের মাধ্যমে আবার ফিরে আসেন। ২০০৫ সালে শ্রীলংকা সিরিজে তিনি আবার ইঞ্জুরিতে পড়েন এবং পুরো সিরিজ থেকেই ছিটকে পড়েন। \n" +
                "\n" +
                "\n" +
                "বাংলাদেশে মোহাম্মদ রফিকের মতো আন্তর্জাতিক মানের স্পিনার থাকলেও আন্তর্জাতিক মানের পেসার ছিল না। সেই অভাব পূরণ করেন ম্যাশ। ২০০৬ ক্রিকেট পঞ্জিকাবর্ষে মাশরাফি ছিলেন একদিনের আন্তর্জাতিক খেলায় সর্বাধিক ৪৯ টি উইকেট নেয়া বোলার। একজন ভাল বোলার হবার পাশাপাশি মাশরাফি একজন মারকুটে ব্যাটসম্যান। ঢাকায় অনুষ্ঠিত ভারতের বিপক্ষে এক ম্যাচে তিনি ৪ বলে ৪ ছক্কা মারেন। সে অভারে ম্যাশ সংগ্রহ করেন ২৬ রান যা বাংলাদেশের পক্ষে কোন ব্যাটসম্যানের এক অভারে করা সর্বোচ্চ রানের রেকর্ড। \n" +
                "\n" +
                "\n" +

                "১৬ বছরের ক্যারিয়ারে ১১ বার চোটের কারণে দলের বাইরে যেতে হয়েছে মাশরাফিকে। চোটের কারণে খেলতে পারেন নি ২০১১ সালের বিশ্বকাপ। এরপরের বিশ্বকাপ, ২০১৫ সালে তিনি অধিনায়ক হিসেবে নেতৃত্ব দেন জাতীয় দলের। ২০১৭ সালে ৬ই এপ্রিল বাংলাদেশ বনাম শ্রীলংকা সিরিজের শেষ টি২০ দিয়ে মাশরাফি আন্তর্জাতিক টি২০ খেলা থেকে অবসর নেন। ২০২০ সালের ৬ মার্চ জিম্বাবুয়ের বিপক্ষে ওয়ানডে ম্যাচের পর জাতীয় দলের অধিনায়ক পদ থেকে সরে যাওয়ার ঘোষণা দেন তিনি। অগনিত মানুষের ভালোবাসায় সিক্ত মাশরাফি বিন মর্তুজা ৮৮টি ওয়ানডে খেলায় নেতৃত্ব দিয়ে ৫০টিতে জয় লাভ করেন।  ",
                images[4],"জীবন বৃত্তান্ত","মাশরাফি বিন মর্তুজা");*/

        /*newsModel = new NewsModel("12/04/2021","পুষ্টিকর পানীয় হিসেবে ফলের রস"," সারাদিনে আমাদের উচিত সর্বনিম্ন ১.৫ লিটার পরিমাণ পানি পান করা। কারণ পানি কেবল আমাদের হজমের জন্য গুরুত্বপূর্ণ নয়, ভিটামিন বি এবং সি এর শোষণের জন্যও প্রয়োজনীয়। এটি দেহের ডিটক্সিফিকেশনে সহায়তা করে এবং রক্তের খুব গুরুত্বপূর্ণ উপাদান। কিন্তু সব সময় আমাদের শুধু পানি পান করতে ইচ্ছা করেনা। মাঝে মাঝেই আমরা কোমল পানীয় পান করে থাকি তৃষ্ণা মেটানোর জন্য।\n" +
                "\n" +
                "\n" +
                "\n" +
                "কিন্তু এই কোমল পানীয় আমাদের শরীরের জন্য কতটুকু নিরাপদ? অধিকাংশ কোমল পানীয়তেই ব্যবহার করা হয়ে থাকে প্রচুর পরিমাণে চিনি আমাদের রক্তের কোলেস্টেরল বাড়ায়। ফলে দেখা দেয় নানাবিধ রোগ। এই সমস্ত কোমল পানীয় পান করার বদলে আমরা কোন ফলের রস পান করতে পারি অথবা স্বাস্থ্যকর কোন পানীয় পান করতে পারি। যেগুলো শুধুমাত্র আমাদের তৃষ্ণাই মেটাবে না বরং শরীরের অনেক উপকারও করে থাকবে।\n" +
                "চলুন জেনে নেই স্বাস্থ্যকর কিছু পানীয় রস সম্পর্কে।\n" +
                " \n" +
                "• ডাবের পানি:\n" +
                "\n" +
                "১০০ গ্রাম ডাবের পানিতে রয়েছে ১৯ ক্যালোরি।\n" +
                "ফ্যাট: ০.২ গ্রাম\n" +
                "কার্বোহাইড্রেট: ৩.৭ গ্রাম\n" +
                "প্রোটিন ০.৭ গ্রাম\n" +
                "সোডিয়াম: ১০৫ মিলিগ্রাম\n" +
                "পটাশিয়াম: ২৫০ মিলিগ্রাম\n" +
                "এছাড়াও রয়েছে যথেষ্ট পরিমাণে ভিটামিন।\n" +
                "\n" +
                "ব্যায়ামের পরে ডাবের পানি পানে ইলেক্ট্রোলাইটগুলো পুনরায় পূরণ হয়ে থাকে। তাই এটি কে ক্রীড়া পানীয় হিসেবেও গ্রহণ করা হয়। ডাবের পানি রক্তে শর্করার নিয়ন্ত্রণ উন্নত করতে পারে। এটি ম্যাগনেসিয়ামের একটি ভাল উৎস, যা ইনসুলিন সংবেদনশীলতা বাড়াতে পারে এবং রক্তে শর্করার মাত্রা হ্রাস করতে পারে। এছাড়াও ডাবের পানি কিডনিতে পাথর হওয়ার সম্ভাবনা হ্রাস করে, রক্তচাপ নিয়ন্ত্রণ করে, ওজন কমাতে সাহায্য করে।\n" +
                "\n" +
                "\n" +
                "• বেলের শরবত:\n" +
                "\n" +
                "১০০ গ্রাম বেলের শরবতে রয়েছে ১৩৪ ক্যালোরি।\n" +
                "ফ্যাট: ১৮ গ্রাম\n" +
                "কার্বোহাইড্রেট: ৩ গ্রাম\n" +
                "প্রোটিন: ৭ গ্রাম\n" +
                "ক্যালসিয়াম: ১৩%\n" +
                "আয়রন: ৬%\n" +
                "ভিটামিন সি: ৩%\n" +
                "\n" +
                "বেলের শরবত পেটের যেকোনো সমস্যা বিরুদ্ধে কাজ করে কারণ এটি হজমের জন্য অত্যন্ত সহায়ক। এটি কোষ্ঠকাঠিন্য, ডায়রিয়া, আমাশয়, পেপটিক আলসার, যকৃতের সমস্যা, ডায়াবেটিস, স্কার্ভি, ম্যালেরিয়া প্রতিরোধে সাহায্য করে।\n" +
                "\n" +
                "\n" +
                "• ডালিমের রস:\n" +
                "\n" +
                "১০০ গ্রাম ডালিমের রসে রয়েছে ৫৪ ক্যালোরি।\n" +
                "ফ্যাট: ০.৩ গ্রাম\n" +
                "কোলেস্টেরল: ০ গ্রাম\n" +
                "সোডিয়াম: ০৯ মিলিগ্রাম\n" +
                "পটাশিয়াম: ২১৪ মিলিগ্রাম\n" +
                "কার্বোহাইড্রেট: ১৩ গ্রাম\n" +
                "প্রোটিন: ০২ গ্রাম\n" +
                "\n" +
                "ডালিমের রস দেহের জন্য অত্যন্ত উপকারী একটি পানীয়। ডালিমের মধ্যে পেনিক্যালগিনস এবং পিউনিক অ্যাসিড থাকে যা স্বাস্থ্যের জন্য নানা ভাবে উপকারী এবং প্রদাহ হ্রাস করে থাকে। এটি পাশাপাশি প্রোস্টেট ক্যান্সার, হৃদরোগ, ডায়াবেটিস এবং ফুসফুসের ক্যান্সারের বিরুদ্ধেও লড়াই করে। গবেষণাগায় দেখা গেছে ডালিমের নির্যাস স্তন ক্যান্সারের কোষ বাড়তে থাকার সম্ভাবনা কমায়।\n" +
                "\n" +
                "• তরমুজের রস:\n" +
                "\n" +
                "১০০ গ্রাম তরমুজের রসে রয়েছে ৩০ ক্যালোরি।\n" +
                "ফ্যাট: ০.১৫ গ্রাম\n" +
                "কার্বোহাইড্রেট: ৭.৫৫ গ্রাম\n" +
                "প্রোটিন: ০.৬১ গ্রাম\n" +
                "কোলেস্টেরল: ০ গ্রাম\n" +
                "সোডিয়াম: ১মিলিগ্রাম\n" +
                "পটাশিয়াম: ১১২ মিলিগ্রাম\n" +
                "\n" +
                "তরমুজের রসে উচ্চ পরিমাণে অ্যান্টিঅক্সিডেন্টস এবং অ্যামিনো অ্যাসিড রয়েছে। তরমুজ কিছু মানুষের রক্তচাপ হ্রাস করতে পারে। এটি ব্যায়ামের পরে মাংসপেশির ক্রাম্পস কমাতে সাহায্য করে। তবে তরমুজে কারো কারো হজমের সমস্যা দেখা দিতে পারে।\n" +
                "\n" +

                " এছাড়া আরও কিছু ফলের রস রয়েছে যা গরমে শরীর ঠান্ডা রাখে এবং সুস্থ রাখতে কাজ করে থাকে। জায়গা অনুযায়ী বিভিন্ন মৌসুমী ফলের শরবত পানীয় হিসেবে পান করা যায়। ",
                images[5],"খাদ্য সমাচার","ফলের রস");*/


        Boolean status = source.addNews(newsModel);

        // if (status) {
        source = new MyDatabaseSource(this);
        arrayList = source.getallNews();
        //Toast.makeText(this, "List: "+arrayList.get(0).getText(), Toast.LENGTH_SHORT).show();
        poplateViewHolder();
        //   }else Toast.makeText(this, "Something went Wrong!!", Toast.LENGTH_SHORT).show();




    }

    private void filter(String toString) {
        ArrayList<NewsModel> filteredList = new ArrayList<>();

        for(NewsModel item : arrayList){
          if (item.getTitle().contains(toString)){
              filteredList.add(item);
          }
        }

        adapter.filterlist(filteredList);
    }

    private void category(String getCategory){

        ArrayList<NewsModel> filteredCategory = new ArrayList<>();

        for(NewsModel item : arrayList){
            if (item.getCategory().contains(getCategory)){
                filteredCategory.add(item);
            }
        }

        adapter.filterlist(filteredCategory);
    }

    private void poplateViewHolder() {
        recycler_news=findViewById(R.id.recycler_news);

        adapter = new NewssAdapter(Main2Activity.this,arrayList);
        recycler_news.setAdapter(adapter);

        adapter.notifyDataSetChanged();
        recycler_news.invalidate();

        recycler_news.setOnItemClickListener(new AdapterView.OnItemClickListener() {
            @Override
            public void onItemClick(AdapterView<?> parent, View view, int position, long id) {
                // Toast.makeText(Main2Activity.this, arrayList.get(position).getTitle(), Toast.LENGTH_SHORT).show();

            }
        });

       /* GridLayoutManager gridLayoutManager=new GridLayoutManager(Main2Activity.this,1,RecyclerView.VERTICAL,false);
        recycler_news.setLayoutManager(gridLayoutManager);
        recycler_news.setNestedScrollingEnabled(false);
        recycler_news.setAdapter(adapter);*/

        // recycler_news
    }

    public void changeimg(View view) {
        // img.setBackgroundResource(images[1]);
        img.setImageDrawable(ContextCompat.getDrawable(this, images[1]));
    }


   /* @Override
    public void onNewsClick(int position) {
        arrayList.get(position);
    }*/
}

